nala.org
#+TITLE: Nala Loom: DotCortex
#+DESCRIPTION: Debian nala package manager, release-backed .deb sync, and Antigravity editor config
#+AUTHOR: Mètsàtron
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent
#+PROPERTY: header-args:bash :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

* Nala/apt manifest
Columns: PKG, VERSION, CATEGORY, SCOPE, EXTRA
- VERSION: empty means latest from apt
- CATEGORY: documentation grouping (bootstrap, cli, desktop, xfce, fonts, media, dev, network, system, gaming, third-party)
- SCOPE: =shared= (all Debian-family), =devuan-only=, =ubuntu-only=
- EXTRA: reserved

#+BEGIN_SRC text :tangle debian/.nala/manifest/packages.ssv :padline no :comments none
# PKG VERSION CATEGORY SCOPE EXTRA
# Captured: 2026-03-18 from Devuan Excalibur T480s + Ubuntu Jammy X230 reference

# --- Bootstrap (also in INSTALL.sh, duplicated here for standalone nala:apply) ---
git "" bootstrap shared ""
stow "" bootstrap shared ""
curl "" bootstrap shared ""
wget "" bootstrap shared ""
make "" bootstrap shared ""
build-essential "" bootstrap shared ""
emacs-nox "" bootstrap shared ""
python3 "" bootstrap shared ""
python3-pip "" bootstrap shared ""
python3-venv "" bootstrap shared ""
nodejs "" bootstrap shared ""
# npm provided by nodesource nodejs or Guix — system npm conflicts with nodesource
keychain "" bootstrap shared ""
jq "" bootstrap shared ""
tree "" bootstrap shared ""
rsync "" bootstrap shared ""
htop "" bootstrap shared ""
pkg-config "" bootstrap shared ""
libssl-dev "" bootstrap shared ""
libfreetype-dev "" bootstrap shared ""
libfontconfig-dev "" bootstrap shared ""

# --- CLI Tools ---
dialog "" cli shared ""
fzf "" cli shared ""
lsof "" cli shared ""
lynx "" cli shared ""
mc "" cli shared ""
meld "" cli shared ""
rename "" cli shared ""
screen "" cli shared ""
trash-cli "" cli shared ""
xclip "" cli shared ""
xdotool "" cli shared ""
xmlstarlet "" cli shared ""
detox "" cli shared ""
jdupes "" cli shared ""
rdfind "" cli shared ""
plocate "" cli shared ""
vim "" cli shared ""

# --- Desktop Apps ---
gparted "" desktop shared ""
kdeconnect "" desktop shared ""
plank "" desktop shared ""
yad "" desktop shared ""
# deskflow - moved to Guix (not in Noble repos)
font-manager "" desktop shared ""
grsync "" desktop shared ""
gthumb "" desktop shared ""
seahorse "" desktop shared ""
picom "" desktop shared ""
pluma "" desktop shared ""
audacity "" desktop shared ""
baobab "" desktop shared ""

# --- XFCE Plugins ---
xfce4-appmenu-plugin "" xfce shared ""
appmenu-registrar "" xfce shared ""
xfce4-clipman-plugin "" xfce shared ""
xfce4-cpugraph-plugin "" xfce shared ""
xfce4-docklike-plugin "" xfce shared ""
xfce4-pulseaudio-plugin "" xfce shared ""
xfce4-systemload-plugin "" xfce shared ""
xfce4-verve-plugin "" xfce shared ""
xfce4-weather-plugin "" xfce shared ""
xfce4-whiskermenu-plugin "" xfce shared ""
xfce4-xkb-plugin "" xfce shared ""

# --- Fonts ---
fonts-noto-color-emoji "" fonts shared ""
fonts-powerline "" fonts shared ""
fonts-unfonts-core "" fonts shared ""

# --- Media ---
ffmpeg "" media shared ""
flac "" media shared ""
sox "" media shared ""
shntool "" media shared ""
cuetools "" media shared ""

# --- Dev Libraries (build deps for Cargo, WezTerm, etc) ---
libssl-dev "" dev shared ""
libfreetype-dev "" dev shared ""
libfontconfig-dev "" dev shared ""
libfontconfig1-dev "" dev shared ""
libsdl2-dev "" dev shared ""
libgtk-3-dev "" dev shared ""
libglib2.0-dev "" dev shared ""
gettext "" dev shared ""
python3-dev "" dev shared ""
python3-setuptools "" dev shared ""
cmake "" dev shared ""
autoconf "" dev shared ""
automake "" dev shared ""
libtool "" dev shared ""
bison "" dev shared ""
flex "" dev shared ""
texinfo "" dev shared ""

# --- System ---
libfuse2t64 "" system shared ""
daemonize "" system devuan-only ""
earlyoom "" system shared ""
smartmontools "" system shared ""
flatpak "" system shared ""
gnome-software-plugin-flatpak "" system shared ""
# fastfetch - moved to Guix (not in Noble repos)
sshfs "" system shared ""
nfs-common "" system shared ""
joystick "" system shared ""
evtest "" system shared ""
xinput "" system shared ""

# --- Network ---
samba "" network shared ""

# --- Gaming ---
fs-uae "" gaming ubuntu-only ""
fs-uae-launcher "" gaming ubuntu-only ""
fs-uae-arcade "" gaming ubuntu-only ""
lutris "" gaming ubuntu-only ""

# --- Third-party (require repos from repos.ssv) ---
signal-desktop "" third-party shared ""
brave-browser "" third-party shared ""
gh "" third-party shared ""
antigravity "" third-party shared ""
winehq-stable "" third-party ubuntu-only ""
jellyfin "" third-party ubuntu-only ""

# --- Ubuntu-only ---
ubuntu-restricted-addons "" system ubuntu-only ""
ppa-purge "" system ubuntu-only ""
zram-tools "" system ubuntu-only ""
mate-utils "" desktop ubuntu-only ""
mkusb "" system ubuntu-only ""
mkusb-nox "" system ubuntu-only ""
#+END_SRC

* Third-party repos manifest
Columns: NAME, TYPE, KEY_URL, REPO_SPEC, OS_MATCH, EXTRA
- TYPE: =key+sources= (GPG key + .sources file), =key+list= (GPG key + .list file), =ppa= (Ubuntu PPA)
- OS_MATCH: =all=, =devuan=, =ubuntu=
- REPO_SPEC may use ={{ARCH}}= for the current =dpkg --print-architecture=

#+BEGIN_SRC text :tangle debian/.nala/manifest/repos.ssv :padline no :comments none
# NAME TYPE KEY_URL REPO_SPEC OS_MATCH EXTRA
signal-desktop key+sources "https://updates.signal.org/desktop/apt/keys.asc" "https://updates.signal.org/static/desktop/apt/signal-desktop.sources" all ""
brave-browser-release key+list "https://brave-browser-apt-release.s3.brave.com/brave-browser-archive-keyring.gpg" "deb [arch=amd64 signed-by=/usr/share/keyrings/brave-browser-release-keyring.gpg] https://brave-browser-apt-release.s3.brave.com/ stable main" all ""
github-cli key+list "https://cli.github.com/packages/githubcli-archive-keyring.gpg" "deb [arch={{ARCH}} signed-by=/etc/apt/keyrings/githubcli-archive-keyring.gpg] https://cli.github.com/packages stable main" all "/etc/apt/keyrings/githubcli-archive-keyring.gpg"
antigravity key+list "https://us-central1-apt.pkg.dev/doc/repo-signing-key.gpg" "deb [signed-by=/etc/apt/keyrings/antigravity-repo-key.gpg] https://us-central1-apt.pkg.dev/projects/antigravity-auto-updater-dev/ antigravity-debian main" all "/etc/apt/keyrings/antigravity-repo-key.gpg"
xfce4-docklike ppa "" "newman2x/xfce4-docklike" ubuntu ""
# Ubuntu-only third-party repos (Noble-targeted)
winehq key+list "https://dl.winehq.org/wine-builds/winehq.key" "deb [arch=amd64,i386 signed-by=/usr/share/keyrings/winehq-keyring.gpg] https://dl.winehq.org/wine-builds/ubuntu noble main" ubuntu ""
jellyfin key+list "https://repo.jellyfin.org/jellyfin_team.gpg.key" "deb [arch=amd64 signed-by=/usr/share/keyrings/jellyfin-keyring.gpg] https://repo.jellyfin.org/ubuntu noble main" ubuntu ""
fsuae key+list "https://download.opensuse.org/repositories/home:FrodeSolheim:stable/xUbuntu_24.04/Release.key" "deb [signed-by=/usr/share/keyrings/fsuae-keyring.gpg] http://download.opensuse.org/repositories/home:/FrodeSolheim:/stable/xUbuntu_24.04/ /" ubuntu ""
mkusb ppa "" "mkusb/ppa" ubuntu ""
ernstp-mesarc ppa "" "ernstp/mesarc" ubuntu ""
#+END_SRC

* GitHub release-backed .deb manifest
For Debian-family apps distributed as GitHub release artifacts instead of apt repos.
Columns: REPO, PKG, ASSET_NAME_OR_GLOB, ARCH, SCOPE, EXTRA
- PKG is the Debian package name from the .deb metadata, not the asset filename.
- ARCH: =amd64=, =arm64=, =all=, or =any=
- SCOPE: =shared=, =devuan-only=, =ubuntu-only=

#+BEGIN_SRC text :tangle debian/.nala/manifest/releases.ssv :padline no :comments none
# repo package asset_name_or_glob arch scope extra
anomalyco/opencode open-code opencode-desktop-linux-amd64.deb amd64 shared ""
matt1398/claude-devtools claude-devtools claude-devtools_*_amd64.deb amd64 shared ""
lakinduakash/linux-wifi-hotspot linux-wifi-hotspot linux-wifi-hotspot_*_amd64.deb amd64 ubuntu-only ""
rustdesk/rustdesk rustdesk rustdesk-*-x86_64.deb amd64 shared ""
dbeaver/dbeaver dbeaver-ce dbeaver-ce-*-linux-x86_64.deb amd64 shared ""
mongodb-js/compass mongodb-compass mongodb-compass_*_amd64.deb amd64 shared ""
#+END_SRC

* Repos setup script
#+BEGIN_SRC bash :tangle debian/.local/bin/nala-repos-setup :shebang "#!/usr/bin/env bash"
set -euo pipefail

MAN="${NALA_REPOS_SSV:-$HOME/.nala/manifest/repos.ssv}"

if [ ! -f "$MAN" ]; then
  echo "No repos manifest at $MAN" >&2
  exit 0
fi

# Detect OS
OS_ID="unknown"
if [ -f /etc/os-release ]; then
  # shellcheck disable=SC1091
  . /etc/os-release
  OS_ID="$ID"
fi
IS_DEVUAN=0
[ -f /etc/devuan_version ] && IS_DEVUAN=1
ARCH="$(dpkg --print-architecture)"

scope_matches() {
  local scope="$1"
  case "$scope" in
    all) return 0 ;;
    devuan) [ "$IS_DEVUAN" -eq 1 ] ;;
    ubuntu) [ "$OS_ID" = "ubuntu" ] ;;
    *) return 0 ;;
  esac
}

CHANGED=0

parse_repo_line() {
  local line="$1"
  local -a parts=()

  mapfile -t parts < <(printf '%s\n' "$line" | xargs -n1 printf '%s\n')
  while [ "${#parts[@]}" -lt 6 ]; do
    parts+=("")
  done
  printf '%s|%s|%s|%s|%s|%s\n' \
    "${parts[0]}" "${parts[1]}" "${parts[2]}" \
    "${parts[3]}" "${parts[4]}" "${parts[5]}"
}

while IFS='|' read -r name type key_url repo_spec os_match _extra; do
  [ -z "$name" ] && continue

  if ! scope_matches "$os_match"; then
    echo "  skip $name (os=$os_match, this=$OS_ID)"
    continue
  fi

  repo_spec="${repo_spec//\{\{ARCH\}\}/$ARCH}"

  case "$type" in
    key+sources)
      # key_url is GPG key, repo_spec is URL to .sources file
      keyring="/usr/share/keyrings/${name}-keyring.gpg"
      sources_file="/etc/apt/sources.list.d/${name}.sources"

      if [ -f "$sources_file" ]; then
        echo "  ok $name (already configured)"
        continue
      fi

      echo "  add $name repo..."
      sudo install -d -m 755 "$(dirname "$keyring")" "$(dirname "$sources_file")"

      # Download and install key
      if [ -n "$key_url" ]; then
        if echo "$key_url" | grep -q '\.gpg$'; then
          sudo wget -qO "$keyring" "$key_url"
        else
          wget -qO- "$key_url" | gpg --dearmor | sudo tee "$keyring" >/dev/null
        fi
        sudo chmod go+r "$keyring"
      fi

      # Download and install sources file
      sudo wget -qO "$sources_file" "$repo_spec"
      CHANGED=1
      echo "  done $name"
      ;;

    ppa)
      # Ubuntu PPA — repo_spec is the PPA string
      if [ "$OS_ID" != "ubuntu" ]; then
        echo "  skip $name (PPA, not Ubuntu)"
        continue
      fi
      if grep -rq "$repo_spec" /etc/apt/sources.list.d/ 2>/dev/null; then
        echo "  ok $name (already configured)"
        continue
      fi
      echo "  add $name PPA..."
      sudo add-apt-repository -y "ppa:$repo_spec"
      CHANGED=1
      ;;

    key+list)
      keyring="${_extra:-}"
      [ -n "$keyring" ] || keyring="/usr/share/keyrings/${name}-keyring.gpg"
      list_file="/etc/apt/sources.list.d/${name}.list"

      if [ -f "$list_file" ] && grep -Fqx "$repo_spec" "$list_file" 2>/dev/null; then
        echo "  ok $name (already configured)"
        continue
      fi

      echo "  add $name repo..."
      sudo install -d -m 755 "$(dirname "$keyring")" "$(dirname "$list_file")"

      if [ -n "$key_url" ]; then
        if echo "$key_url" | grep -q '\.gpg$'; then
          sudo wget -qO "$keyring" "$key_url"
        else
          wget -qO- "$key_url" | gpg --dearmor --yes | sudo tee "$keyring" >/dev/null
        fi
        sudo chmod go+r "$keyring"
      fi

      printf '%s\n' "$repo_spec" | sudo tee "$list_file" >/dev/null
      CHANGED=1
      ;;

    *)
      echo "  unknown repo type: $type for $name" >&2
      ;;
  esac
done < <(
  while IFS= read -r raw; do
    line="${raw#${raw%%[![:space:]]*}}"
    line="${line%${line##*[![:space:]]}}"
    [ -z "$line" ] && continue
    case "$line" in
      \#*) continue ;;
    esac
    parse_repo_line "$line"
  done < "$MAN"
)

if [ "$CHANGED" -eq 1 ]; then
  echo "Repos changed, updating package lists..."
  APT="apt-get"
  command -v nala &>/dev/null && APT="nala"
  sudo $APT update
fi
#+END_SRC

