nala.org
* Release-backed .deb sync
#+BEGIN_SRC bash :tangle debian/.local/bin/nala-release-sync :shebang "#!/usr/bin/env bash"
set -euo pipefail

MAN="${NALA_RELEASES_SSV:-$HOME/.nala/manifest/releases.ssv}"
CACHE_BASE="${XDG_CACHE_HOME:-$HOME/.cache}/nala/releases"

[ -f "$MAN" ] || exit 0

OS_ID="unknown"
if [ -f /etc/os-release ]; then
  # shellcheck disable=SC1091
  . /etc/os-release
  OS_ID="$ID"
fi
IS_DEVUAN=0
[ -f /etc/devuan_version ] && IS_DEVUAN=1
ARCH="$(dpkg --print-architecture)"

scope_matches() {
  local scope="$1"
  case "$scope" in
    shared|"") return 0 ;;
    devuan-only) [ "$IS_DEVUAN" -eq 1 ] ;;
    ubuntu-only) [ "$OS_ID" = "ubuntu" ] ;;
    *) return 0 ;;
  esac
}

arch_matches() {
  local want="$1"
  case "$want" in
    any|all|"") return 0 ;;
    "$ARCH") return 0 ;;
    *) return 1 ;;
  esac
}

detect_apt() {
  if command -v nala &>/dev/null; then
    printf '%s\n' nala
  else
    printf '%s\n' apt-get
  fi
}

gh_latest_json() {
  local repo="$1" url="https://api.github.com/repos/${repo}/releases/latest"
  if [ -n "${GH_TOKEN:-}" ]; then
    curl -fsSL -H "Authorization: Bearer $GH_TOKEN" "$url"
  else
    curl -fsSL "$url"
  fi
}

normalize_ver() {
  sed -E 's/^v//' <<<"$1"
}

installed_version() {
  local pkg="$1"
  dpkg-query -W -f='${Version}\n' "$pkg" 2>/dev/null || true
}

cache_dir() {
  local pkg="$1"
  printf '%s/%s\n' "$CACHE_BASE" "$pkg"
}

write_cache_meta() {
  local dir="$1" json="$2" tag="$3" name="$4" url="$5" digest="$6"
  mkdir -p "$dir"
  printf '%s\n' "$json" > "$dir/latest.json"
  printf '%s\n' "$tag" > "$dir/tag"
  printf '%s\n' "$name" > "$dir/asset.name"
  printf '%s\n' "$url" > "$dir/asset.url"
  printf '%s\n' "$digest" > "$dir/asset.digest"
}

install_local_deb() {
  local apt_bin="$1" bundle="$2"
  local pkg_name
  pkg_name="$(dpkg-deb --field "$bundle" Package 2>/dev/null || true)"
  echo "  -> installing $(basename "$bundle") with $apt_bin"
  sudo DEBIAN_FRONTEND=noninteractive "$apt_bin" install -y "$bundle" || true
  # Nala sometimes returns 0 but silently skips — verify the package is installed
  if [ -n "$pkg_name" ] && dpkg -l "$pkg_name" 2>/dev/null | grep -q "^ii"; then
    return 0
  fi
  echo "  -> $apt_bin did not install $pkg_name, retrying with dpkg + apt-get -f"
  sudo DEBIAN_FRONTEND=noninteractive dpkg -i "$bundle" || true
  sudo DEBIAN_FRONTEND=noninteractive apt-get install -f -y
}

sync_one() {
  local apt_bin="$1" repo="$2" pkg="$3" asset_glob="$4" want_arch="$5" scope="$6"
  local json latest_tag latest_ver asset_name asset_url asset_digest dir bundle tmp old_name cached_digest cached_tag installed
  local bundle_pkg bundle_ver effective_pkg compare_ver
  local asset_entry_name asset_entry_url asset_entry_digest

  if ! scope_matches "$scope"; then
    echo "  skip $pkg (scope=$scope, this=$OS_ID)"
    return 0
  fi

  if ! arch_matches "$want_arch"; then
    echo "  skip $pkg (arch=$want_arch, this=$ARCH)"
    return 0
  fi

  json="$(gh_latest_json "$repo")"
  latest_tag="$(jq -r '.tag_name' <<<"$json")"
  latest_ver="$(normalize_ver "$latest_tag")"

  while IFS=$'\t' read -r asset_entry_name asset_entry_url asset_entry_digest; do
    case "$asset_entry_name" in
      $asset_glob)
        asset_name="$asset_entry_name"
        asset_url="$asset_entry_url"
        asset_digest="$asset_entry_digest"
        break
        ;;
    esac
  done < <(jq -r '.assets[] | [.name, .browser_download_url, (.digest // "")] | @tsv' <<<"$json")

  [ -n "${asset_url:-}" ] || {
    echo "  ! no release asset matching $asset_glob for $repo" >&2
    return 1
  }

  dir="$(cache_dir "$pkg")"
  mkdir -p "$dir"
  bundle="$dir/$asset_name"
  old_name="$( [ -f "$dir/asset.name" ] && cat "$dir/asset.name" || true )"
  cached_digest="$( [ -f "$dir/asset.digest" ] && cat "$dir/asset.digest" || true )"
  cached_tag="$( [ -f "$dir/tag" ] && cat "$dir/tag" || true )"

  if [ -n "$old_name" ] && [ "$old_name" != "$asset_name" ] && [ -f "$dir/$old_name" ]; then
    rm -f "$dir/$old_name"
  fi

  if [ ! -s "$bundle" ] \
    || { [ -n "$asset_digest" ] && [ "$cached_digest" != "$asset_digest" ]; } \
    || { [ -z "$asset_digest" ] && [ "$cached_tag" != "$latest_tag" ]; }; then
    tmp="$bundle.part"
    curl -fL "$asset_url" -o "$tmp"
    mv -f "$tmp" "$bundle"
  fi

  write_cache_meta "$dir" "$json" "$latest_tag" "$asset_name" "$asset_url" "$asset_digest"

  bundle_pkg="$(dpkg-deb -f "$bundle" Package 2>/dev/null || true)"
  bundle_ver="$(dpkg-deb -f "$bundle" Version 2>/dev/null || true)"
  effective_pkg="$pkg"
  [ -n "$bundle_ver" ] && compare_ver="$bundle_ver" || compare_ver="$latest_ver"

  if [ -n "$bundle_pkg" ] && [ "$bundle_pkg" != "$pkg" ]; then
    echo "  ! manifest package $pkg differs from deb metadata $bundle_pkg; using deb metadata"
    effective_pkg="$bundle_pkg"
  fi

  installed="$(installed_version "$effective_pkg")"
  echo "  release: pkg=$effective_pkg arch=$want_arch latest=$compare_ver installed=${installed:-none}"
  if [ -n "$installed" ] && dpkg --compare-versions "$installed" ge "$compare_ver"; then
    echo "  -> already current, skipping install for $effective_pkg"
    return 0
  fi

  install_local_deb "$apt_bin" "$bundle"
}

APT_BIN="$(detect_apt)"

echo "== Syncing release-backed .deb packages =="
while IFS='|' read -r repo pkg asset_glob want_arch scope _extra; do
  [ -n "$repo" ] || continue
  sync_one "$APT_BIN" "$repo" "$pkg" "$asset_glob" "$want_arch" "$scope" || true
done < <(
  awk -v FS='[ \t]+' '
    function dq(s){ return (s == "\"\"" ? "" : s) }
    /^[ \t]*#/ || NF==0 { next }
    {
      printf "%s|%s|%s|%s|%s|%s\n",
        dq($1), dq($2), dq($3), dq($4), dq($5), dq($6)
    }
  ' "$MAN"
)
#+END_SRC

