nala.org
* Apply script
#+BEGIN_SRC bash :tangle debian/.local/bin/nala-apply :shebang "#!/usr/bin/env bash"
set -euo pipefail

MAN="${NALA_SSV:-$HOME/.nala/manifest/packages.ssv}"
ENFORCE="${ENFORCE:-1}"
UNINSTALL="${UNINSTALL:-0}"
REL_SYNC_HELPER="${HOME}/.local/bin/nala-release-sync"
[ -x "$REL_SYNC_HELPER" ] || REL_SYNC_HELPER="${HOME}/DotCortex/debian/.local/bin/nala-release-sync"

if [ ! -f "$MAN" ]; then
  echo "No manifest at $MAN" >&2
  exit 1
fi

# --- Detect OS ---
OS_ID="unknown"
if [ -f /etc/os-release ]; then
  # shellcheck disable=SC1091
  . /etc/os-release
  OS_ID="$ID"
fi
IS_DEVUAN=0
[ -f /etc/devuan_version ] && IS_DEVUAN=1

scope_matches() {
  local scope="$1"
  case "$scope" in
    shared) return 0 ;;
    devuan-only) [ "$IS_DEVUAN" -eq 1 ] ;;
    ubuntu-only) [ "$OS_ID" = "ubuntu" ] ;;
    *) return 0 ;;
  esac
}

# --- Bootstrap nala if missing ---
APT="apt-get"
if command -v nala &>/dev/null; then
  APT="nala"
else
  echo "nala not found, installing..."
  sudo apt-get update
  sudo apt-get install -y nala || {
    echo "nala install failed, falling back to apt-get"
    APT="apt-get"
  }
  command -v nala &>/dev/null && APT="nala"
fi
echo "Using: $APT"

# --- Parse manifest, filter by scope ---
INSTALL_LIST=()

while IFS='|' read -r pkg _ver _cat scope _extra; do
  [ -z "$pkg" ] && continue

  if ! scope_matches "$scope"; then
    continue
  fi

  # Check if already installed
  if dpkg -s "$pkg" &>/dev/null 2>&1; then
    continue
  fi

  # Check if package exists in repos
  if ! apt-cache show "$pkg" &>/dev/null 2>&1; then
    echo "Error: $pkg not found" >&2
    continue
  fi

  INSTALL_LIST+=("$pkg")
done < <(
  awk -v FS='[ \t]+' '
    function dq(s){ return (s == "\"\"" ? "" : s) }
    /^[ \t]*#/ || NF==0 { next }
    {
      printf "%s|%s|%s|%s|%s\n",
        dq($1), dq($2), dq($3), dq($4), dq($5)
    }
  ' "$MAN"
)

# --- Install missing ---
if [ ${#INSTALL_LIST[@]} -eq 0 ]; then
  echo "All manifest packages are installed."
else
  echo "Installing ${#INSTALL_LIST[@]} packages..."
  printf "  %s\n" "${INSTALL_LIST[@]}"
  sudo DEBIAN_FRONTEND=noninteractive $APT install -y "${INSTALL_LIST[@]}" || {
    if [ "$APT" = "nala" ]; then
      echo "nala failed (broken resolver), falling back to apt-get..."
      sudo DEBIAN_FRONTEND=noninteractive apt-get install -y "${INSTALL_LIST[@]}"
    else
      exit 1
    fi
  }
fi

if [ -x "$REL_SYNC_HELPER" ]; then
  "$REL_SYNC_HELPER"
fi

echo "Done."
#+END_SRC

* Antigravity settings, Linux
#+BEGIN_SRC json :tangle linux/.config/Antigravity/User/settings.json :mkdirp yes :comments no
{
  "claudeCode.preferredLocation": "panel",

  "terminal.integrated.commandsToSkipShell": [
    "workbench.action.terminal.sendSequence"
  ],

  "terminal.integrated.profiles.linux": {
    "bash": {
      "path": "bash",
      "icon": "terminal-bash"
    },
    "zsh": {
      "path": "/home/metsatron/.guix-extra-profiles/core/core/bin/zsh"
    },
    "fish": {
      "path": "fish"
    },
    "tmux": {
      "path": "tmux",
      "icon": "terminal-tmux"
    },
    "pwsh": {
      "path": "pwsh",
      "icon": "terminal-powershell"
    },
    "Guix zsh (sandbox)": {
      "path": "/bin/sh",
      "args": [
        "-lc",
        "exec \"$HOME/.guix-extra-profiles/core/core/bin/zsh\" -l"
      ],
      "overrideName": true
    },
    "Guix zsh (host)": {
      "path": "/usr/bin/flatpak-spawn",
      "args": [
        "--host",
        "/bin/sh",
        "-lc",
        "exec \"$HOME/.guix-extra-profiles/core/core/bin/zsh\" -l"
      ],
      "overrideName": true
    }
  },
  "terminal.integrated.defaultProfile.linux": "zsh",
  "terminal.integrated.inheritEnv": false,
  "terminal.integrated.env.linux": { "LD_PRELOAD": "" },
  "terminal.integrated.fontFamily": "'SFMono Nerd Font Mono','SF Mono','SFMono Nerd Font',monospace",

  "editor.fontFamily": "'SF Mono','SFMono Nerd Font','JetBrainsMono Nerd Font',Menlo,Monaco,'Courier New',monospace",
  "editor.fontLigatures": true,

  "extensions.experimental.affinity": {
    "asvetliakov.vscode-neovim": 1
  },
  "vscode-neovim.neovimExecutablePaths.linux": "/home/metsatron/.guix-extra-profiles/core/core/bin/nvim",

  "vim.enable": true,
  "vim.useSystemClipboard": true,
  "python.languageServer": "Default",
  "workbench.activityBar.location": "bottom"
}
#+END_SRC

#+BEGIN_SRC json :tangle linux/.config/Antigravity/User/keybindings.json :mkdirp yes :comments no
[
  {
    "key": "shift+enter",
    "command": "-workbench.action.terminal.sendSequence",
    "when": "terminalFocus"
  },
  {
    "key": "shift+enter",
    "command": "workbench.action.terminal.sendSequence",
    "args": {
      "text": "\u001b\u000d"
    },
    "when": "terminalFocus"
  },
  { "key": "z", "command": "-vscode-neovim.send" },
  { "key": "z c", "command": "-list.collapse" },
  { "key": "z m", "command": "-list.collapseAll" },
  { "key": "z shift+m", "command": "-list.collapseAll" },
  { "key": "z shift+c", "command": "-list.collapseAllToFocus" },
  { "key": "z o", "command": "-list.expand" },
  { "key": "z shift+o", "command": "-list.expand" },
  { "key": "z a", "command": "-list.toggleExpand" },
  { "key": "z shift+a", "command": "-list.toggleExpand" }
]
#+END_SRC

#+BEGIN_SRC conf :tangle linux/.local/share/applications/antigravity.desktop :mkdirp yes :comments no
[Desktop Entry]
Name=Antigravity
Comment=Experience liftoff
GenericName=Text Editor
Exec=env PATH=/home/metsatron/.local/bin:/home/metsatron/.npm-global/bin:/home/metsatron/.guix-extra-profiles/core/core/bin:/usr/local/bin:/usr/bin:/bin /usr/share/antigravity/antigravity %F
Icon=antigravity
Type=Application
StartupNotify=false
StartupWMClass=Antigravity
Categories=TextEditor;Development;IDE;
MimeType=application/x-antigravity-workspace;
Actions=new-empty-window;
Keywords=vscode;

[Desktop Action new-empty-window]
Name=New Empty Window
Exec=env PATH=/home/metsatron/.local/bin:/home/metsatron/.npm-global/bin:/home/metsatron/.guix-extra-profiles/core/core/bin:/usr/local/bin:/usr/bin:/bin /usr/share/antigravity/antigravity --new-window %F
Icon=antigravity
#+END_SRC

* Diff script
#+BEGIN_SRC bash :tangle debian/.local/bin/nala-diff :shebang "#!/usr/bin/env bash"
set -euo pipefail

MAN="${NALA_SSV:-$HOME/.nala/manifest/packages.ssv}"
REL_DIFF_HELPER="${HOME}/.local/bin/nala-release-diff"
[ -x "$REL_DIFF_HELPER" ] || REL_DIFF_HELPER="${HOME}/DotCortex/debian/.local/bin/nala-release-diff"

if [ ! -f "$MAN" ]; then
  echo "No manifest at $MAN" >&2
  exit 1
fi

# --- Detect OS ---
OS_ID="unknown"
if [ -f /etc/os-release ]; then
  # shellcheck disable=SC1091
  . /etc/os-release
  OS_ID="$ID"
fi
IS_DEVUAN=0
[ -f /etc/devuan_version ] && IS_DEVUAN=1

# --- Extract wanted packages (filtered by scope) ---
wanted_tmp="$(mktemp)"
trap 'rm -f "$wanted_tmp"' EXIT

awk -v FS='[ \t]+' -v is_devuan="$IS_DEVUAN" -v os_id="$OS_ID" '
  function dq(s){ return (s == "\"\"" ? "" : s) }
  /^[ \t]*#/ || NF==0 { next }
  {
    pkg = dq($1)
    scope = dq($4)
    if (scope == "shared") print pkg
    else if (scope == "devuan-only" && is_devuan == 1) print pkg
    else if (scope == "ubuntu-only" && os_id == "ubuntu") print pkg
  }
' "$MAN" | sort -u > "$wanted_tmp"

# --- Get installed manual packages ---
have_tmp="$(mktemp)"
trap 'rm -f "$wanted_tmp" "$have_tmp"' EXIT

dpkg-query -W -f='${Package}\n' | sort -u > "$have_tmp"

# --- Diff ---
to_install="$(comm -23 "$wanted_tmp" "$have_tmp")"
# Show manually installed that aren't in manifest (informational only)

echo "=== nala:diff ==="
echo

if [ -n "$to_install" ]; then
  count=$(echo "$to_install" | wc -l)
  echo "[to install] ($count packages)"
  echo "$to_install" | sed 's/^/  + /'
else
  echo "[to install] (none)"
fi

echo
echo "Manifest: $(wc -l < "$wanted_tmp") packages for this OS"
echo "Installed: $(wc -l < "$have_tmp") total dpkg packages"

if [ -x "$REL_DIFF_HELPER" ]; then
  echo
  "$REL_DIFF_HELPER" || true
fi
#+END_SRC

* Release-backed .deb diff
#+BEGIN_SRC bash :tangle debian/.local/bin/nala-release-diff :shebang "#!/usr/bin/env bash"
set -euo pipefail

MAN="${NALA_RELEASES_SSV:-$HOME/.nala/manifest/releases.ssv}"

[ -f "$MAN" ] || exit 0

OS_ID="unknown"
if [ -f /etc/os-release ]; then
  # shellcheck disable=SC1091
  . /etc/os-release
  OS_ID="$ID"
fi
IS_DEVUAN=0
[ -f /etc/devuan_version ] && IS_DEVUAN=1
ARCH="$(dpkg --print-architecture)"

scope_matches() {
  local scope="$1"
  case "$scope" in
    shared|"") return 0 ;;
    devuan-only) [ "$IS_DEVUAN" -eq 1 ] ;;
    ubuntu-only) [ "$OS_ID" = "ubuntu" ] ;;
    *) return 0 ;;
  esac
}

arch_matches() {
  local want="$1"
  case "$want" in
    any|all|"") return 0 ;;
    "$ARCH") return 0 ;;
    *) return 1 ;;
  esac
}

gh_latest_json() {
  local repo="$1" url="https://api.github.com/repos/${repo}/releases/latest"
  if [ -n "${GH_TOKEN:-}" ]; then
    curl -fsSL -H "Authorization: Bearer $GH_TOKEN" "$url"
  else
    curl -fsSL "$url"
  fi
}

normalize_ver() {
  sed -E 's/^v//' <<<"$1"
}

installed_version() {
  local pkg="$1"
  dpkg-query -W -f='${Version}\n' "$pkg" 2>/dev/null || true
}

echo "[release-backed debs]"
while IFS='|' read -r repo pkg asset_glob want_arch scope _extra; do
  [ -n "$repo" ] || continue

  if ! scope_matches "$scope"; then
    echo "  . $pkg skipped (scope=$scope, this=$OS_ID)"
    continue
  fi

  if ! arch_matches "$want_arch"; then
    echo "  . $pkg skipped (arch=$want_arch, this=$ARCH)"
    continue
  fi

  json="$(gh_latest_json "$repo")"
  latest_tag="$(jq -r '.tag_name' <<<"$json")"
  latest_ver="$(normalize_ver "$latest_tag")"
  resolved_asset_name=""
  while IFS=$'\t' read -r asset_entry_name _asset_entry_url _asset_entry_digest; do
    case "$asset_entry_name" in
      $asset_glob)
        resolved_asset_name="$asset_entry_name"
        break
        ;;
    esac
  done < <(jq -r '.assets[] | [.name, .browser_download_url, (.digest // "")] | @tsv' <<<"$json")

  if [ -z "$resolved_asset_name" ]; then
    echo "  ? $pkg (no release asset matching $asset_glob in $repo)"
    continue
  fi

  have="$(installed_version "$pkg")"
  if [ -z "$have" ]; then
    echo "  + $pkg (missing -> $latest_ver, asset $resolved_asset_name)"
    continue
  fi

  if dpkg --compare-versions "$have" ge "$latest_ver"; then
    echo "  = $pkg ($have, asset $resolved_asset_name)"
  else
    echo "  ~ $pkg ($have -> $latest_ver, asset $resolved_asset_name)"
  fi
done < <(
  awk -v FS='[ \t]+' '
    function dq(s){ return (s == "\"\"" ? "" : s) }
    /^[ \t]*#/ || NF==0 { next }
    {
      printf "%s|%s|%s|%s|%s|%s\n",
        dq($1), dq($2), dq($3), dq($4), dq($5), dq($6)
    }
  ' "$MAN"
)
#+END_SRC

