debian/.local/bin/nala-apply
#!/usr/bin/env bash
# Apply script

# [[file:../../../nala.org::*Apply script][Apply script:1]]
set -euo pipefail

MAN="${NALA_SSV:-$HOME/.nala/manifest/packages.ssv}"
ENFORCE="${ENFORCE:-1}"
UNINSTALL="${UNINSTALL:-0}"
REL_SYNC_HELPER="${HOME}/.local/bin/nala-release-sync"
[ -x "$REL_SYNC_HELPER" ] || REL_SYNC_HELPER="${HOME}/DotCortex/debian/.local/bin/nala-release-sync"

if [ ! -f "$MAN" ]; then
  echo "No manifest at $MAN" >&2
  exit 1
fi

# --- Detect OS ---
OS_ID="unknown"
if [ -f /etc/os-release ]; then
  # shellcheck disable=SC1091
  . /etc/os-release
  OS_ID="$ID"
fi
IS_DEVUAN=0
[ -f /etc/devuan_version ] && IS_DEVUAN=1

scope_matches() {
  local scope="$1"
  case "$scope" in
    shared) return 0 ;;
    devuan-only) [ "$IS_DEVUAN" -eq 1 ] ;;
    ubuntu-only) [ "$OS_ID" = "ubuntu" ] ;;
    *) return 0 ;;
  esac
}

# --- Bootstrap nala if missing ---
APT="apt-get"
if command -v nala &>/dev/null; then
  APT="nala"
else
  echo "nala not found, installing..."
  sudo apt-get update
  sudo apt-get install -y nala || {
    echo "nala install failed, falling back to apt-get"
    APT="apt-get"
  }
  command -v nala &>/dev/null && APT="nala"
fi
echo "Using: $APT"

# --- Parse manifest, filter by scope ---
INSTALL_LIST=()

while IFS='|' read -r pkg _ver _cat scope _extra; do
  [ -z "$pkg" ] && continue

  if ! scope_matches "$scope"; then
    continue
  fi

  # Check if already installed
  if dpkg -s "$pkg" &>/dev/null 2>&1; then
    continue
  fi

  # Check if package exists in repos
  if ! apt-cache show "$pkg" &>/dev/null 2>&1; then
    echo "Error: $pkg not found" >&2
    continue
  fi

  INSTALL_LIST+=("$pkg")
done < <(
  awk -v FS='[ \t]+' '
    function dq(s){ return (s == "\"\"" ? "" : s) }
    /^[ \t]*#/ || NF==0 { next }
    {
      printf "%s|%s|%s|%s|%s\n",
        dq($1), dq($2), dq($3), dq($4), dq($5)
    }
  ' "$MAN"
)

# --- Install missing ---
if [ ${#INSTALL_LIST[@]} -eq 0 ]; then
  echo "All manifest packages are installed."
else
  echo "Installing ${#INSTALL_LIST[@]} packages..."
  printf "  %s\n" "${INSTALL_LIST[@]}"
  sudo $APT install -y "${INSTALL_LIST[@]}" || {
    if [ "$APT" = "nala" ]; then
      echo "nala failed (broken resolver), falling back to apt-get..."
      sudo apt-get install -y "${INSTALL_LIST[@]}"
    else
      exit 1
    fi
  }
fi

if [ -x "$REL_SYNC_HELPER" ]; then
  "$REL_SYNC_HELPER"
fi

echo "Done."
# Apply script:1 ends here
