debian/.local/bin/nala-release-diff
#!/usr/bin/env bash
# Release-backed .deb diff

# [[file:../../../nala.org::*Release-backed .deb diff][Release-backed .deb diff:1]]
set -euo pipefail

MAN="${NALA_RELEASES_SSV:-$HOME/.nala/manifest/releases.ssv}"

[ -f "$MAN" ] || exit 0

OS_ID="unknown"
if [ -f /etc/os-release ]; then
  # shellcheck disable=SC1091
  . /etc/os-release
  OS_ID="$ID"
fi
IS_DEVUAN=0
[ -f /etc/devuan_version ] && IS_DEVUAN=1
ARCH="$(dpkg --print-architecture)"

scope_matches() {
  local scope="$1"
  case "$scope" in
    shared|"") return 0 ;;
    devuan-only) [ "$IS_DEVUAN" -eq 1 ] ;;
    ubuntu-only) [ "$OS_ID" = "ubuntu" ] ;;
    *) return 0 ;;
  esac
}

arch_matches() {
  local want="$1"
  case "$want" in
    any|all|"") return 0 ;;
    "$ARCH") return 0 ;;
    *) return 1 ;;
  esac
}

gh_latest_json() {
  local repo="$1" url="https://api.github.com/repos/${repo}/releases/latest"
  if [ -n "${GH_TOKEN:-}" ]; then
    curl -fsSL -H "Authorization: Bearer $GH_TOKEN" "$url"
  else
    curl -fsSL "$url"
  fi
}

normalize_ver() {
  sed -E 's/^v//' <<<"$1"
}

installed_version() {
  local pkg="$1"
  dpkg-query -W -f='${Version}\n' "$pkg" 2>/dev/null || true
}

echo "[release-backed debs]"
while IFS='|' read -r repo pkg asset_glob want_arch scope _extra; do
  [ -n "$repo" ] || continue

  if ! scope_matches "$scope"; then
    echo "  . $pkg skipped (scope=$scope, this=$OS_ID)"
    continue
  fi

  if ! arch_matches "$want_arch"; then
    echo "  . $pkg skipped (arch=$want_arch, this=$ARCH)"
    continue
  fi

  json="$(gh_latest_json "$repo")"
  latest_tag="$(jq -r '.tag_name' <<<"$json")"
  latest_ver="$(normalize_ver "$latest_tag")"
  resolved_asset_name=""
  while IFS=$'\t' read -r asset_entry_name _asset_entry_url _asset_entry_digest; do
    case "$asset_entry_name" in
      $asset_glob)
        resolved_asset_name="$asset_entry_name"
        break
        ;;
    esac
  done < <(jq -r '.assets[] | [.name, .browser_download_url, (.digest // "")] | @tsv' <<<"$json")

  if [ -z "$resolved_asset_name" ]; then
    echo "  ? $pkg (no release asset matching $asset_glob in $repo)"
    continue
  fi

  have="$(installed_version "$pkg")"
  if [ -z "$have" ]; then
    echo "  + $pkg (missing -> $latest_ver, asset $resolved_asset_name)"
    continue
  fi

  if dpkg --compare-versions "$have" ge "$latest_ver"; then
    echo "  = $pkg ($have, asset $resolved_asset_name)"
  else
    echo "  ~ $pkg ($have -> $latest_ver, asset $resolved_asset_name)"
  fi
done < <(
  awk -v FS='[ \t]+' '
    function dq(s){ return (s == "\"\"" ? "" : s) }
    /^[ \t]*#/ || NF==0 { next }
    {
      printf "%s|%s|%s|%s|%s|%s\n",
        dq($1), dq($2), dq($3), dq($4), dq($5), dq($6)
    }
  ' "$MAN"
)
# Release-backed .deb diff:1 ends here
