nala.org
* Capture script
#+BEGIN_SRC bash :tangle debian/.local/bin/nala-capture :shebang "#!/usr/bin/env bash"
set -euo pipefail

MAN="${NALA_SSV:-$HOME/.nala/manifest/packages.ssv}"

if [ ! -f "$MAN" ]; then
  echo "No manifest at $MAN — creating with header" >&2
  mkdir -p "$(dirname "$MAN")"
  echo '# PKG VERSION CATEGORY SCOPE EXTRA' > "$MAN"
fi

# Get packages already in manifest
existing_tmp="$(mktemp)"
trap 'rm -f "$existing_tmp"' EXIT
awk -v FS='[ \t]+' '!/^[ \t]*#/ && NF { print $1 }' "$MAN" | sort -u > "$existing_tmp"

# Get manually installed packages
manual_tmp="$(mktemp)"
trap 'rm -f "$existing_tmp" "$manual_tmp"' EXIT
apt-mark showmanual | sort -u > "$manual_tmp"

# Find new (manually installed but not in manifest)
new_pkgs="$(comm -23 "$manual_tmp" "$existing_tmp")"

if [ -z "$new_pkgs" ]; then
  echo "No new manually-installed packages to capture."
  exit 0
fi

count=$(echo "$new_pkgs" | wc -l)
echo "Found $count new manually-installed packages:"
echo "$new_pkgs" | sed 's/^/  /'
echo

echo "Appending to $MAN with category=uncategorized scope=shared"
echo "" >> "$MAN"
echo "# --- Captured $(date +%Y-%m-%d) ---" >> "$MAN"
while IFS= read -r pkg; do
  printf '%s "" uncategorized shared ""\n' "$pkg" >> "$MAN"
done <<< "$new_pkgs"

echo "Done. Review and recategorize in nala.org."
#+END_SRC

* Health script
#+BEGIN_SRC bash :tangle debian/.local/bin/nala-health :shebang "#!/usr/bin/env bash"
set -euo pipefail

echo "=== nala:health ==="
echo

# OS info
if [ -f /etc/os-release ]; then
  # shellcheck disable=SC1091
  . /etc/os-release
  echo "OS:    $PRETTY_NAME"
fi
[ -f /etc/devuan_version ] && echo "Init:  sysvinit (Devuan $(cat /etc/devuan_version))"

# Package manager
if command -v nala &>/dev/null; then
  echo "Nala:  $(nala --version 2>&1 | head -1)"
else
  echo "Nala:  not installed (will use apt-get)"
fi
echo "Apt:   $(apt-get --version | head -1)"

# Counts
MAN="${NALA_SSV:-$HOME/.nala/manifest/packages.ssv}"
if [ -f "$MAN" ]; then
  manifest_count=$(awk -v FS='[ \t]+' '!/^[ \t]*#/ && NF { c++ } END { print c+0 }' "$MAN")
  echo "SSV:   $manifest_count packages in manifest"
else
  echo "SSV:   no manifest found at $MAN"
fi

installed_count=$(dpkg-query -W -f='x\n' | wc -l)
manual_count=$(apt-mark showmanual | wc -l)
echo "Dpkg:  $installed_count installed, $manual_count manual"

REL_MAN="${NALA_RELEASES_SSV:-$HOME/.nala/manifest/releases.ssv}"
if [ -f "$REL_MAN" ]; then
  release_count=$(awk -v FS='[ \t]+' '!/^[ \t]*#/ && NF { c++ } END { print c+0 }' "$REL_MAN")
  echo "Rels:  $release_count GitHub-backed .deb entries"
else
  echo "Rels:  no release manifest found at $REL_MAN"
fi

# Third-party repos
repo_count=$(ls /etc/apt/sources.list.d/ 2>/dev/null | wc -l)
echo "Repos: $repo_count in sources.list.d/"
ls /etc/apt/sources.list.d/ 2>/dev/null | sed 's/^/  /'
#+END_SRC

* Make targets
#+BEGIN_SRC makefile :tangle all/.mk/nala.mk :padline no :comments none
# Nala/apt Make targets fragment. Requires GNU Make 3.82+.
.RECIPEPREFIX := |
SHELL := /bin/bash

.PHONY: nala-repos nala-capture nala-diff nala-release-diff nala-release-sync nala-sync nala-apply nala-health

nala-repos:
| @chmod +x $(HOME)/.local/bin/nala-repos-setup 2>/dev/null || true
| $(HOME)/.local/bin/nala-repos-setup

nala-capture:
| @chmod +x $(HOME)/.local/bin/nala-capture 2>/dev/null || true
| $(HOME)/.local/bin/nala-capture

nala-diff:
| @chmod +x $(HOME)/.local/bin/nala-diff 2>/dev/null || true
| $(HOME)/.local/bin/nala-diff

nala-release-diff:
| @chmod +x $(HOME)/.local/bin/nala-release-diff 2>/dev/null || true
| $(HOME)/.local/bin/nala-release-diff

nala-release-sync:
| @chmod +x $(HOME)/.local/bin/nala-release-sync 2>/dev/null || true
| $(HOME)/.local/bin/nala-release-sync

nala-sync: nala-repos
| @chmod +x $(HOME)/.local/bin/nala-apply 2>/dev/null || true
| ENFORCE=0 UNINSTALL=0 $(HOME)/.local/bin/nala-apply

nala-apply: nala-repos
| sudo nala upgrade
| @chmod +x $(HOME)/.local/bin/nala-apply 2>/dev/null || true
| ENFORCE=1 UNINSTALL=0 $(HOME)/.local/bin/nala-apply

nala-health:
| @chmod +x $(HOME)/.local/bin/nala-health 2>/dev/null || true
| $(HOME)/.local/bin/nala-health
#+END_SRC

* Ubuntu release upgrade helpers
Scripts for the 22.04 (Jammy) → 24.04 (Noble) upgrade on the X230.
Run =nala-pre-upgrade= first, then =sudo do-release-upgrade=, then =nala-post-upgrade=.

** Pre-upgrade script
#+BEGIN_SRC bash :tangle x230/.local/bin/nala-pre-upgrade :shebang "#!/usr/bin/env bash"
set -euo pipefail

LOG="/tmp/nala-pre-upgrade-$(date +%Y%m%d_%H%M%S).log"
exec > >(tee -a "$LOG") 2>&1

echo "=== nala:pre-upgrade (22.04 → 24.04) ==="
echo "Log: $LOG"
echo

# Verify we're on Ubuntu 22.04
# shellcheck disable=SC1091
. /etc/os-release
if [ "$ID" != "ubuntu" ] || [ "${VERSION_ID}" != "22.04" ]; then
  echo "ERROR: Expected Ubuntu 22.04, got $PRETTY_NAME" >&2
  echo "This script is only for the 22.04 → 24.04 upgrade." >&2
  exit 1
fi
echo "OS: $PRETTY_NAME — OK"

# 1. Unhold python3-click
echo
echo "[1/6] Releasing held packages..."
if apt-mark showhold | grep -q "python3-click"; then
  sudo apt-mark unhold python3-click
  echo "  released python3-click"
else
  echo "  python3-click not held — OK"
fi

# 2. ppa-purge ernstp/mesarc (downgrades all 51 ~j~mesarc packages to Ubuntu stock Mesa)
echo
echo "[2/6] Purging ernstp/mesarc Mesa PPA (51 packages → Ubuntu stock)..."
if dpkg -l 2>/dev/null | grep -q "~j~mesarc"; then
  sudo ppa-purge ppa:ernstp/mesarc
  echo "  mesarc purged — Mesa downgraded to Ubuntu stock"
else
  echo "  no ~j~mesarc packages found — skipping"
fi

# 3. Purge WineHQ (no in-place upgrade path; reinstall post-upgrade from Noble repo)
echo
echo "[3/6] Removing WineHQ packages and repo..."
WINE_PKGS=()
for pkg in winehq-stable wine-stable wine-stable-amd64 wine-stable-i386; do
  dpkg -s "$pkg" &>/dev/null 2>&1 && WINE_PKGS+=("$pkg") || true
done
if [ ${#WINE_PKGS[@]} -gt 0 ]; then
  sudo apt-get purge -y "${WINE_PKGS[@]}"
  echo "  purged: ${WINE_PKGS[*]}"
else
  echo "  no WineHQ packages installed — OK"
fi
if [ -f /etc/apt/sources.list.d/winehq-jammy.sources ]; then
  sudo rm -f /etc/apt/sources.list.d/winehq-jammy.sources
  echo "  removed winehq-jammy.sources"
fi

# 4. Purge linux-wifi-hotspot (no Noble PPA; will reinstall from GitHub .deb post-upgrade)
echo
echo "[4/6] Removing linux-wifi-hotspot (no Noble PPA)..."
if dpkg -s linux-wifi-hotspot &>/dev/null 2>&1; then
  sudo apt-get purge -y linux-wifi-hotspot
  echo "  linux-wifi-hotspot removed"
else
  echo "  linux-wifi-hotspot not installed — OK"
fi

# 5. Disable third-party repos that have no Noble packages
# Signal (xenial) and Volian/nala (scar) are rolling — leave active
echo
echo "[5/6] Disabling jammy-hardcoded third-party repos..."
DISABLE=(
  "home:FrodeSolheim:stable.list"
  "lutris-team-ubuntu-lutris-jammy.list"
  "jellyfin.list"
  "mkusb-ubuntu-ppa-jammy.list"
  "dupeguru-ubuntu-ppa-jammy.list"
  "megasync.list"
  "adelolmo.github.io.list"
  "ernstp-ubuntu-mesarc-jammy.list"
  "lakinduakash-ubuntu-lwh-jammy.list"
)
for repo in "${DISABLE[@]}"; do
  f="/etc/apt/sources.list.d/$repo"
  if [ -f "$f" ]; then
    sudo mv "$f" "${f}.bak"
    echo "  disabled: $repo"
  fi
done
echo "  signal-desktop (xenial, rolling) — left active"
echo "  volian-archive-scar (rolling) — left active"

# 6. Verify apt is clean
echo
echo "[6/6] Verifying apt clean state..."
sudo apt-get update
sudo apt-get full-upgrade -y

echo
echo "=== Pre-upgrade complete ==="
echo
echo "Before running do-release-upgrade, strip Guix from PATH in the same terminal:"
echo "  export PATH=\$(echo \$PATH | tr ':' '\n' | grep -v '/gnu\\|/.guix-profile\\|guix' | tr '\n' ':')"
echo "  unset GUIX_PROFILE GUIX_LOCPATH"
echo
echo "Then run: sudo do-release-upgrade"
echo "Log: $LOG"
#+END_SRC

