x230/.local/bin/nala-pre-upgrade
#!/usr/bin/env bash
# Pre-upgrade script

# [[file:../../../nala.org::*Pre-upgrade script][Pre-upgrade script:1]]
set -euo pipefail

LOG="/tmp/nala-pre-upgrade-$(date +%Y%m%d_%H%M%S).log"
exec > >(tee -a "$LOG") 2>&1

echo "=== nala:pre-upgrade (22.04 → 24.04) ==="
echo "Log: $LOG"
echo

# Verify we're on Ubuntu 22.04
# shellcheck disable=SC1091
. /etc/os-release
if [ "$ID" != "ubuntu" ] || [ "${VERSION_ID}" != "22.04" ]; then
  echo "ERROR: Expected Ubuntu 22.04, got $PRETTY_NAME" >&2
  echo "This script is only for the 22.04 → 24.04 upgrade." >&2
  exit 1
fi
echo "OS: $PRETTY_NAME — OK"

# 1. Unhold python3-click
echo
echo "[1/6] Releasing held packages..."
if apt-mark showhold | grep -q "python3-click"; then
  sudo apt-mark unhold python3-click
  echo "  released python3-click"
else
  echo "  python3-click not held — OK"
fi

# 2. ppa-purge ernstp/mesarc (downgrades all 51 ~j~mesarc packages to Ubuntu stock Mesa)
echo
echo "[2/6] Purging ernstp/mesarc Mesa PPA (51 packages → Ubuntu stock)..."
if dpkg -l 2>/dev/null | grep -q "~j~mesarc"; then
  sudo ppa-purge ppa:ernstp/mesarc
  echo "  mesarc purged — Mesa downgraded to Ubuntu stock"
else
  echo "  no ~j~mesarc packages found — skipping"
fi

# 3. Purge WineHQ (no in-place upgrade path; reinstall post-upgrade from Noble repo)
echo
echo "[3/6] Removing WineHQ packages and repo..."
WINE_PKGS=()
for pkg in winehq-stable wine-stable wine-stable-amd64 wine-stable-i386; do
  dpkg -s "$pkg" &>/dev/null 2>&1 && WINE_PKGS+=("$pkg") || true
done
if [ ${#WINE_PKGS[@]} -gt 0 ]; then
  sudo apt-get purge -y "${WINE_PKGS[@]}"
  echo "  purged: ${WINE_PKGS[*]}"
else
  echo "  no WineHQ packages installed — OK"
fi
if [ -f /etc/apt/sources.list.d/winehq-jammy.sources ]; then
  sudo rm -f /etc/apt/sources.list.d/winehq-jammy.sources
  echo "  removed winehq-jammy.sources"
fi

# 4. Purge linux-wifi-hotspot (no Noble PPA; will reinstall from GitHub .deb post-upgrade)
echo
echo "[4/6] Removing linux-wifi-hotspot (no Noble PPA)..."
if dpkg -s linux-wifi-hotspot &>/dev/null 2>&1; then
  sudo apt-get purge -y linux-wifi-hotspot
  echo "  linux-wifi-hotspot removed"
else
  echo "  linux-wifi-hotspot not installed — OK"
fi

# 5. Disable third-party repos that have no Noble packages
# Signal (xenial) and Volian/nala (scar) are rolling — leave active
echo
echo "[5/6] Disabling jammy-hardcoded third-party repos..."
DISABLE=(
  "home:FrodeSolheim:stable.list"
  "lutris-team-ubuntu-lutris-jammy.list"
  "jellyfin.list"
  "mkusb-ubuntu-ppa-jammy.list"
  "dupeguru-ubuntu-ppa-jammy.list"
  "megasync.list"
  "adelolmo.github.io.list"
  "ernstp-ubuntu-mesarc-jammy.list"
  "lakinduakash-ubuntu-lwh-jammy.list"
)
for repo in "${DISABLE[@]}"; do
  f="/etc/apt/sources.list.d/$repo"
  if [ -f "$f" ]; then
    sudo mv "$f" "${f}.bak"
    echo "  disabled: $repo"
  fi
done
echo "  signal-desktop (xenial, rolling) — left active"
echo "  volian-archive-scar (rolling) — left active"

# 6. Verify apt is clean
echo
echo "[6/6] Verifying apt clean state..."
sudo apt-get update
sudo apt-get full-upgrade -y

echo
echo "=== Pre-upgrade complete ==="
echo
echo "Before running do-release-upgrade, strip Guix from PATH in the same terminal:"
echo "  export PATH=\$(echo \$PATH | tr ':' '\n' | grep -v '/gnu\\|/.guix-profile\\|guix' | tr '\n' ':')"
echo "  unset GUIX_PROFILE GUIX_LOCPATH"
echo
echo "Then run: sudo do-release-upgrade"
echo "Log: $LOG"
# Pre-upgrade script:1 ends here
