nala.org
** Post-upgrade script
#+BEGIN_SRC bash :tangle x230/.local/bin/nala-post-upgrade :shebang "#!/usr/bin/env bash"
set -euo pipefail

LOG="/tmp/nala-post-upgrade-$(date +%Y%m%d_%H%M%S).log"
exec > >(tee -a "$LOG") 2>&1

echo "=== nala:post-upgrade (after 22.04 → 24.04) ==="
echo "Log: $LOG"
echo

# Verify we're on Ubuntu 24.04
# shellcheck disable=SC1091
. /etc/os-release
if [ "$ID" != "ubuntu" ] || [ "${VERSION_ID}" != "24.04" ]; then
  echo "ERROR: Expected Ubuntu 24.04, got $PRETTY_NAME" >&2
  echo "Run this script after completing the 22.04 → 24.04 upgrade." >&2
  exit 1
fi
echo "OS: $PRETTY_NAME — OK"

# 1. Remove leftover .bak repo files (will be replaced by nala-repos-setup)
echo
echo "[1/5] Cleaning up .bak repo stubs..."
for bak in /etc/apt/sources.list.d/*.bak; do
  [ -f "$bak" ] || continue
  sudo rm -f "$bak"
  echo "  removed: $(basename "$bak")"
done

# 2. Set up third-party repos from manifest (Noble-targeted)
echo
echo "[2/5] Setting up third-party repos..."
REPOS_SETUP="${HOME}/.local/bin/nala-repos-setup"
[ -x "$REPOS_SETUP" ] || REPOS_SETUP="${HOME}/DotCortex/debian/.local/bin/nala-repos-setup"
if [ -x "$REPOS_SETUP" ]; then
  "$REPOS_SETUP"
else
  echo "  nala-repos-setup not found — tangle nala.org first" >&2
fi

# 3. Install packages from manifest
echo
echo "[3/5] Applying nala package manifest..."
NALA_APPLY="${HOME}/.local/bin/nala-apply"
[ -x "$NALA_APPLY" ] || NALA_APPLY="${HOME}/DotCortex/debian/.local/bin/nala-apply"
if [ -x "$NALA_APPLY" ]; then
  "$NALA_APPLY"
else
  echo "  nala-apply not found — tangle nala.org first" >&2
fi

# 4. Install WineHQ stable with full 32-bit suite
echo
echo "[4/5] Installing WineHQ stable (Noble)..."
if apt-cache show winehq-stable &>/dev/null 2>&1; then
  sudo apt-get install -y --install-recommends winehq-stable
  echo "  WineHQ stable installed"
else
  echo "  winehq-stable not in repos — check that winehq repo was added in step 2" >&2
fi

# 5. Sync GitHub-release-backed debs (linux-wifi-hotspot, rustdesk, dbeaver, compass)
echo
echo "[5/5] Syncing GitHub-release-backed .deb packages..."
RELEASE_SYNC="${HOME}/.local/bin/nala-release-sync"
[ -x "$RELEASE_SYNC" ] || RELEASE_SYNC="${HOME}/DotCortex/debian/.local/bin/nala-release-sync"
if [ -x "$RELEASE_SYNC" ]; then
  "$RELEASE_SYNC"
else
  echo "  nala-release-sync not found — tangle nala.org first" >&2
fi

echo
echo "=== Post-upgrade setup complete ==="
echo "Review any errors above, then:"
echo "  tangle-one nala.org && loom stow:x230"
echo "Log: $LOG"
#+END_SRC

* Old Ubuntu X230 reference
This is the raw dump from Ubuntu 22.04 Jammy on the X230. Kept for reference when deciding what to add to the manifest above.
Not tangled — documentation only.

** DPKG Ubuntu main/universe
#+BEGIN_SRC text
alsa-oss                                 UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
adb                                      UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
android-sdk-platform-tools               UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
apt-file                                 UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
apt-transport-https                      UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/universe amd64 Packages
audacity                                 UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
autoconf                                 UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/main amd64 Packages
automake                                 UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/main amd64 Packages
barrier                                  UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
bison                                    UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/main amd64 Packages
black                                    UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
build-essential                          UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/main amd64 Packages
chromium-browser-l10n                    UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/universe amd64 Packages
ciso                                     UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
chromium-chromedriver                    UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/universe amd64 Packages
cmake                                    UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/main amd64 Packages
cpufrequtils                             UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
cuetools                                 UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
curl                                     UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/main amd64 Packages
detox                                    UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
dialog                                   UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
docker.io                                UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/universe amd64 Packages
earlyoom                                 UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
eom                                      UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
ext4magic                                UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
extundelete                              UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
fastboot                                 UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
fd-find                                  UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/universe amd64 Packages
filezilla                                UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/universe amd64 Packages
firejail                                 UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
flac                                     UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/universe amd64 Packages
flatpak                                  UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/universe amd64 Packages
flex                                     UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/main amd64 Packages
flite                                    UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
font-manager                             UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
fontforge                                UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/universe amd64 Packages
fonts-noto-color-emoji                   UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/main amd64 Packages
fonts-noto-ui-extra                      UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
fonts-powerline                          UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
freeglut3-dev                            UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
fs-uae                                   UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
g++-multilib                             UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/main amd64 Packages
fzf                                      UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/universe amd64 Packages
gcc                                      UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/main amd64 Packages
gcc-multilib                             UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/main amd64 Packages
gimp-data-extras                         UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
gettext                                  UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/main amd64 Packages
gimp-gmic                                UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
gimp-help-en                             UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
gimp-plugin-registry                     UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
gir1.2-libxfce4ui-2.0                    UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
gir1.2-libxfce4util-1.0                  UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
git                                      UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/main amd64 Packages
gnome-software-plugin-flatpak            UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/universe amd64 Packages
gnome-terminal                           UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/main amd64 Packages
grsync                                   UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
gsmartcontrol                            UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
gstreamer1.0-pulseaudio                  UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/main amd64 Packages
gthumb                                   UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
gtk2-engines-pixbuf                      UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/main amd64 Packages
gtk3-nocsd                               UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
handbrake                                UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
htop                                     UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/main amd64 Packages
hunspell-en-au                           UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/main amd64 Packages
hyphen-en-us                             UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/main amd64 Packages
img2pdf                                  UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
inkscape                                 UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
intltool                                 UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
jdupes                                   UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
jq                                       UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy-updates/main amd64 Packages
jstest-gtk                               UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
kdeconnect                               UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
kdenlive                                 UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
krita                                    UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
krita-gmic                               UBUNTU         500 http://au.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages
#+END_SRC
