debian/.local/bin/nala-post-upgrade
#!/usr/bin/env bash
# Post-upgrade script

# [[file:../../../nala.org::*Post-upgrade script][Post-upgrade script:1]]
set -euo pipefail

LOG="/tmp/nala-post-upgrade-$(date +%Y%m%d_%H%M%S).log"
exec > >(tee -a "$LOG") 2>&1

echo "=== nala:post-upgrade (after 22.04 → 24.04) ==="
echo "Log: $LOG"
echo

# Verify we're on Ubuntu 24.04
# shellcheck disable=SC1091
. /etc/os-release
if [ "$ID" != "ubuntu" ] || [ "${VERSION_ID}" != "24.04" ]; then
  echo "ERROR: Expected Ubuntu 24.04, got $PRETTY_NAME" >&2
  echo "Run this script after completing the 22.04 → 24.04 upgrade." >&2
  exit 1
fi
echo "OS: $PRETTY_NAME — OK"

# 1. Remove leftover .bak repo files (will be replaced by nala-repos-setup)
echo
echo "[1/5] Cleaning up .bak repo stubs..."
for bak in /etc/apt/sources.list.d/*.bak; do
  [ -f "$bak" ] || continue
  sudo rm -f "$bak"
  echo "  removed: $(basename "$bak")"
done

# 2. Set up third-party repos from manifest (Noble-targeted)
echo
echo "[2/5] Setting up third-party repos..."
REPOS_SETUP="${HOME}/.local/bin/nala-repos-setup"
[ -x "$REPOS_SETUP" ] || REPOS_SETUP="${HOME}/DotCortex/debian/.local/bin/nala-repos-setup"
if [ -x "$REPOS_SETUP" ]; then
  "$REPOS_SETUP"
else
  echo "  nala-repos-setup not found — tangle nala.org first" >&2
fi

# 3. Install packages from manifest
echo
echo "[3/5] Applying nala package manifest..."
NALA_APPLY="${HOME}/.local/bin/nala-apply"
[ -x "$NALA_APPLY" ] || NALA_APPLY="${HOME}/DotCortex/debian/.local/bin/nala-apply"
if [ -x "$NALA_APPLY" ]; then
  "$NALA_APPLY"
else
  echo "  nala-apply not found — tangle nala.org first" >&2
fi

# 4. Install WineHQ stable with full 32-bit suite
echo
echo "[4/5] Installing WineHQ stable (Noble)..."
if apt-cache show winehq-stable &>/dev/null 2>&1; then
  sudo apt-get install -y --install-recommends winehq-stable
  echo "  WineHQ stable installed"
else
  echo "  winehq-stable not in repos — check that winehq repo was added in step 2" >&2
fi

# 5. Sync GitHub-release-backed debs (linux-wifi-hotspot, rustdesk, dbeaver, compass)
echo
echo "[5/5] Syncing GitHub-release-backed .deb packages..."
RELEASE_SYNC="${HOME}/.local/bin/nala-release-sync"
[ -x "$RELEASE_SYNC" ] || RELEASE_SYNC="${HOME}/DotCortex/debian/.local/bin/nala-release-sync"
if [ -x "$RELEASE_SYNC" ]; then
  "$RELEASE_SYNC"
else
  echo "  nala-release-sync not found — tangle nala.org first" >&2
fi

echo
echo "=== Post-upgrade setup complete ==="
echo "Review any errors above, then:"
echo "  tangle-one nala.org && loom stow:x230"
echo "Log: $LOG"
# Post-upgrade script:1 ends here
